import './app.style.scss'
import { Route, Routes,useLocation} from 'react-router-dom'
import { useEffect } from 'react'
import { scrollTop } from './repetitiveVariables/variables'
import Header from './components/header/Header'
import Main from './components/homepage/main/Main'
import Footer from './components/footer/Footer'
import Armenia from './components/sections/armenia/Armenia'
import Region from './components/sections/region/Region'
import ErrorPage from './components/errorpage/ErrorPage'
import Subsection from './components/sections/subsection/Subsection'
import SinglePage from './components/blogsinglepage/SinglePage'
import Search from './components/search/Search'
import LiveStream from './components/livestream/LiveStream'
import SinglePageVideo from './components/blogsinglepage/singlepagevideo/SinglePageVideo'
import AdminPanel from './components/adminpanel/AdminPanel'
import EditContent from './components/adminpanel/editcontent/EditContent'
import AddContent from './components/adminpanel/addcontent/AddContent'
import International from './components/sections/international/International'
import SingleEditContent from './components/adminpanel/editcontent/singleeditcontent/SingleEditContent'

const dataLegalNew = [
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
  {region:"Իրավական",
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/Rectangle108.png",
},
]

const dataLegalGlobal = [
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"../img/cyclist.png",
},
]

const dataInternationalNews = [
  {
    id: 1,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 2,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 3,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 4,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 5,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id:6,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 7,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 8,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
  {
    id: 9,
    title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
    description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
    img: "/img/Rectangle108.png",
    views: 2,
    countryId: 1,
    categoryId: 1,
    newsContentId: 2,
    createdAt: "2024-02-20T08:06:53.331Z",
    updatedAt: "2024-02-20T10:09:41.666Z",
    newsContent: {
      id: 2,
      title: "Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ, ծում ոդիո ունում լուդուս եու",
      description: "Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա, ադ վիս վիթաե քուիդամ,   դիամ թռիթանի ածծուսամուս, իդ սոլեաթ դեթեռռուիսսեթ մեդիոծռիթաթեմ մել, մեա քուիս նուսքուամ եի. ",
      author: "Valod",
      fileId: 6,
      createdAt: "2024-02-20T08:06:53.312Z",
      updatedAt: "2024-02-20T08:06:53.312Z"
    },
    country: {
      id: 1,
      title: "armenia",
      createdAt: "2024-02-20T08:01:26.424Z",
      updatedAt: "2024-02-20T08:01:26.424Z"
    },
    category: {
      id: 1,
      title: "politics",
      createdAt: "2024-02-20T08:02:33.263Z",
      updatedAt: "2024-02-20T08:02:33.263Z"
    }
  },
]

const dataInternationalGlobal = [
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
  {
  date:"Հուլ 3,2023",
  title:"Lոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ",
  about:"Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա Լոռեմ իպսում դոլոռ սիթ ամեթ, քուո ադ ծհոռո եխեռծի դելիծաթա",
  img:"./img/cyclist.png",
},
]


const App = () => {
  const {pathname} = useLocation()
  
  useEffect(() => {
  scrollTop()
  }, [pathname])

  return (
    <div className='global'>
      
    {pathname.includes("admin")?null:<Header/>}
    
    <Routes >
    <Route index element={<Main/>}/>
      <Route path='news/:id' element={<SinglePage/>}/>
      <Route path='videos/:id' element={<SinglePageVideo/>}/>

      <Route path='armenia' element = {<Armenia/>}/>
      <Route path='armenia/politics' element = {<Subsection title="Քաղաքական" dataGlobal={dataInternationalNews}/>}/>
      <Route path='armenia/legal' element = {<Subsection title="Իրավական" dataGlobal={dataInternationalNews}/>}/>
      <Route path='armenia/military' element = {<Subsection title="Ռազմական" dataGlobal={dataInternationalNews}/>}/>
      <Route path='armenia/society' element = {<Subsection title="Հասարակություն" dataGlobal={dataInternationalNews}/>}/>
      
      <Route path='region' element = {<Region/>}/>
      <Route path='region/turkey' element = {<Subsection title="Թուրքիա" dataGlobal={dataInternationalNews}/>}/>
      <Route path='region/georgia' element = {<Subsection title="Վրաստան" dataGlobal={dataInternationalNews}/>}/>
      <Route path='region/iran' element = {<Subsection title="Իրան" dataGlobal={dataInternationalNews}/>}/>
      <Route path='region/azerbaijan' element = {<Subsection title="Ադրբեջան" dataGlobal={dataInternationalNews}/>}/>
      

      <Route path='international' element = {<International title="Միջազգային" dataNew={dataInternationalNews} dataGlobal={dataInternationalNews}/>}/>
      <Route path='live' element = {<LiveStream/>}/>
      <Route path='search' element = {<Search/>}/>


      <Route path='admin' element = {<AdminPanel/>}>
        <Route path='/admin/add' element = {<AddContent/>} />
        <Route path='/admin/edit' element = {<EditContent/>}>
            <Route path='/admin/edit/:id' element = {<SingleEditContent/>} />
        </Route>
      </Route>

      
    
      <Route path='*' element = {<ErrorPage/>}/>
    </Routes>
    
    {pathname.includes("admin")?null:<Footer/>}

    </div>
  )
}

export default App